## "Обработка списка фруктов"

### Задание

Дана ведомость расчета заработной платы [data/workers.txt](data/workers.txt).

Рассчитайте зарплату всех работников, зная что они получат полный оклад, если отработают норму часов. \
Если же они отработали меньше нормы, то их ЗП уменьшается пропорционально, \
а за каждый час переработки они получают удвоенную ЗП, пропорциональную норме. \
Кол-во часов, которые были отработаны, указаны в файле ["data/hours_of.txt](data/hours_of.txt)

### Формат входных данных

Дано два текстовых файла. Один с информацией о сотрудниках, второй с количеством отработанных часов.

Гарантируется, что каждый сотрудник имеет уникальную фамилию(однофамильцев нет).

### Формат выходных данных

Выведите зарплату сотрудников с учетом переработки и недоработки.

### Решение задачи

with open('data\workers.txt', 'r', encoding='utf-8') as f:
    for line in f:
        tabl = line.rstrip().split()
        if tabl[2].isdigit():
            surname = tabl[1]

            cash_in_hour = int(tabl[2]) / int(tabl[4])
            with open('data\hours_of.txt', 'r', encoding='utf-8') as f_h:
                for line_new in f_h:
                    tabl_new = line_new.rstrip().split()
                    if tabl[2].isdigit():
                        for i in tabl_new:
                            if i == surname:
                                print(f"Зарплата {i} равна {round(cash_in_hour * int(tabl_new[2]))}")
```

---
