# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

n = [-9, -5. - 3, 0, 7, 8 ,10]
summa = 0
for element in n:
    summa = summa + element

print(summa)
