# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

n = [-9, -5. - 3, 0, 7, 8 ,10]
summa = 0
for summa1 in n:
    if summa1>0:
        summa = summa + summa1

print(summa)
