# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой

def circles(x1, y1, x2, y2, r1, r2):
    return (((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5 + r2) <= r1


ax = 1
ay = 2
ra = 5

bx = 3
by = 4
rb = 3

if not circles(ax, ay, ra, bx, by, rb):
    print("Не находится")
else:
    print("Находится")
