# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# n = ["name1", "name2", "name3", "name4"]
name_str= ",".join(n)
print(name_str)


# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
