# Дан список имен.
# Найдите самое длинное имя, если таких имен несколько - выведи любое их них

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

max_name = ""
for i in names:
    if len(i) >= len(max_name):
        max_name = i
print(max_name)
